In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.1.1'

In [4]:
df = pd.DataFrame() #empty dataframe

In [5]:
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
sep=','
df = pd.read_csv(url, sep = sep)

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.head()  #top five

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df.tail()  #bottom five

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
# Get basic information about the dataset
print("\nBasic Information:")
print(df.info())

Basic Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [10]:
# Get a statistical summary of the dataset
print("\nStatistical Summary:")
print(df.describe())

Statistical Summary:
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [11]:
# Check for missing values
print("\nMissing values in each column:")
print(df.isnull().sum())

Missing values in each column:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
# Fill missing 'Age' values with the mean age
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [ ]:
# Drop rows where 'Embarked' is missing
df.dropna(subset=['Embarked'], inplace=True)

In [13]:
# Verify missing values are handled
print("\nMissing values after handling:")
print(df.isnull().sum())

Missing values after handling:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
# Select specific columns
selected_columns = df[['Name', 'Age', 'Sex', 'Survived']]
print("\nSelected Columns:")
print(selected_columns.head())

Selected Columns:
                                                Name   Age     Sex  Survived
0                            Braund, Mr. Owen Harris  22.0    male         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female         1
2                             Heikkinen, Miss. Laina  26.0  female         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female         1
4                           Allen, Mr. William Henry  35.0    male         0

In [15]:
# Filter rows where passengers survived
survived_passengers = df[df['Survived'] == 1]
print("\nSurvived Passengers:")
print(survived_passengers.head())

Survived Passengers:
   PassengerId  Survived  Pclass  \
1            2         1       1
2            3         1       3
3            4         1       1
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C

In [16]:
# Filter rows where passengers are children (Age < 18)
children = df[df['Age'] < 18]
print("\nChildren:")
print(children.head())

Children:
    PassengerId  Survived  Pclass                                  Name  \
7             8         0       3        Palsson, Master. Gosta Leonard
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
16           17         0       3                  Rice, Master. Eugene

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
7     male   2.0      3      1   349909  21.0750   NaN        S
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
16    male   2.0      4      1   382652  29.1250   NaN        Q

In [17]:
# Group by 'Pclass' and calculate the mean age for each class
mean_age_per_class = df.groupby('Pclass')['Age'].mean()
print("\nMean Age per Class:")
print(mean_age_per_class)

Mean Age per Class:
Pclass
1    37.048118
2    29.866958
3    26.403259
Name: Age, dtype: float64

In [18]:
# Group by 'Sex' and calculate the survival rate
survival_rate_by_sex = df.groupby('Sex')['Survived'].mean()
print("\nSurvival Rate by Sex:")
print(survival_rate_by_sex)

Survival Rate by Sex:
Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [19]:
# Create a new column 'Age_Group' based on the age
df['Age_Group'] = pd.cut(df['Age'], bins=[0, 12, 18, 60, 80], labels=['Child', 'Teen', 'Adult', 'Senior'])
print("\nAge Group Distribution:")
print(df['Age_Group'].value_counts())

Age Group Distribution:
Age_Group
Adult     730
Teen       70
Child      69
Senior     22
Name: count, dtype: int64

In [20]:
# Create a new column 'Family_Size' by adding 'SibSp' and 'Parch'
df['Family_Size'] = df['SibSp'] + df['Parch']
print("\nFamily Size Distribution:")
print(df['Family_Size'].value_counts())

Family Size Distribution:
Family_Size
0     537
1     161
2     102
3      29
5      22
4      15
6      12
10      7
7       6
Name: count, dtype: int64

In [21]:
# Sort by 'Age'
sorted_by_age = df.sort_values(by='Age')
print("\nSorted by Age:")
print(sorted_by_age[['Name', 'Age']].head())

Sorted by Age:
                                Name   Age
803  Thomas, Master. Assad Alexander  0.42
755        Hamalainen, Master. Viljo  0.67
644           Baclini, Miss. Eugenie  0.75
469    Baclini, Miss. Helene Barbara  0.75
831  Richards, Master. George Sibley  0.83

In [22]:
# Sort by 'Fare' in descending order
sorted_by_fare = df.sort_values(by='Fare', ascending=False)
print("\nSorted by Fare:")
print(sorted_by_fare[['Name', 'Fare']].head())

Sorted by Fare:
                                   Name      Fare
258                    Ward, Miss. Anna  512.3292
737              Lesurer, Mr. Gustave J  512.3292
679  Cardeza, Mr. Thomas Drake Martinez  512.3292
88           Fortune, Miss. Mabel Helen  263.0000
27       Fortune, Mr. Charles Alexander  263.0000

In [23]:
# Example DataFrame to merge
additional_info = pd.DataFrame({
    'PassengerId': [1, 2, 3],
    'Ticket_Class': ['First', 'Second', 'Third']
})